#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-postgresql-go_repo_71E2AED7: Preparing import... [id=cdktn-provider-postgresql-go]
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 8s [id=15746607]
github_repository.cdktn-provider-postgresql_repo_8DD4A065: Preparing import... [id=cdktn-provider-postgresql]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-alert-prs-slack-webhook-url_4C020E89 will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-alert-prs-slack-webhook-url_4C020E89" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-gh-app-id-alias-PROJEN_APP_ID_7A0E0E6C will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-gh-app-id-alias-PROJEN_APP_ID_7A0E0E6C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-gh-app-id_95F06E29 will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-gh-app-id_95F06E29" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_FF4DC63C will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_FF4DC63C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-gh-app-private-key_3C0C09FD will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-gh-app-private-key_3C0C09FD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_622B0C91 will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_622B0C91" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_1D8642C4 will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_1D8642C4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-gh-token_6D2E994E will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-gh-token_6D2E994E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-npm-token_D9BA49D8 will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-npm-token_D9BA49D8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-twine-password_919D4EE8 will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-twine-password_919D4EE8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-postgresql_repo_secret-twine-username_13C3A690 will be created
  + resource "github_actions_secret" "cdktn-provider-postgresql_repo_secret-twine-username_13C3A690" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-postgresql"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-postgresql_repository-setup_main-protection_B04C8B9F will be created
  + resource "github_branch_protection" "cdktn-provider-postgresql_repository-setup_main-protection_B04C8B9F" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-postgresql"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-postgresql-go_repository-setup_auto-approve-label_708A2688 will be created
  + resource "github_issue_label" "cdktn-provider-postgresql-go_repository-setup_auto-approve-label_708A2688" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-postgresql-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-postgresql-go_repository-setup_automerge-label_32647FE7 will be created
  + resource "github_issue_label" "cdktn-provider-postgresql-go_repository-setup_automerge-label_32647FE7" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-postgresql-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-postgresql-go_repository-setup_no-auto-close-label_6D26FB85 will be created
  + resource "github_issue_label" "cdktn-provider-postgresql-go_repository-setup_no-auto-close-label_6D26FB85" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-postgresql-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-postgresql_repository-setup_auto-approve-label_11D73FD3 will be created
  + resource "github_issue_label" "cdktn-provider-postgresql_repository-setup_auto-approve-label_11D73FD3" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-postgresql"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-postgresql_repository-setup_automerge-label_F7883681 will be created
  + resource "github_issue_label" "cdktn-provider-postgresql_repository-setup_automerge-label_F7883681" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-postgresql"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-postgresql_repository-setup_no-auto-close-label_62E70032 will be created
  + resource "github_issue_label" "cdktn-provider-postgresql_repository-setup_no-auto-close-label_62E70032" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-postgresql"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-postgresql-go_repo_71E2AED7 will be updated in-place
  # (imported from "cdktn-provider-postgresql-go")
  ~ resource "github_repository" "cdktn-provider-postgresql-go_repo_71E2AED7" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for postgresql."
        etag                        = "W/\"bf8de60f03cffa354b40ea9fbe6fb769f9e565b186a585a0d7e6d28d8a73048a\""
        full_name                   = "cdktn-io/cdktn-provider-postgresql-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-postgresql-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-postgresql-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-postgresql-go.git"
        id                          = "cdktn-provider-postgresql-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-postgresql-go"
        node_id                     = "R_kgDORT_wnA"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1161818268
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-postgresql-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-postgresql-go"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "postgresql",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-postgresql_repo_8DD4A065 will be updated in-place
  # (imported from "cdktn-provider-postgresql")
  ~ resource "github_repository" "cdktn-provider-postgresql_repo_8DD4A065" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for postgresql."
        etag                        = "W/\"52ef492f2df81e20aa46893ccc67584a9420a8e10e52f0fbb4a777051f2da416\""
        full_name                   = "cdktn-io/cdktn-provider-postgresql"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-postgresql.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-postgresql"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-postgresql.git"
        id                          = "cdktn-provider-postgresql"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-postgresql"
        node_id                     = "R_kgDORT_vTQ"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1161817933
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-postgresql.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-postgresql"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "postgresql",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-postgresql_dependabot-security_00EBFB2E will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-postgresql_dependabot-security_00EBFB2E" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-postgresql"
    }

  # github_repository_webhook.cdktn-provider-postgresql-go_repository-setup_slack-webhook_D0C47F80 will be created
  + resource "github_repository_webhook" "cdktn-provider-postgresql-go_repository-setup_slack-webhook_D0C47F80" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-postgresql-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-postgresql_repository-setup_slack-webhook_E83098CD will be created
  + resource "github_repository_webhook" "cdktn-provider-postgresql_repository-setup_slack-webhook_E83098CD" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-postgresql"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-postgresql-go_repository-setup_managing-team_B82743C6 will be created
  + resource "github_team_repository" "cdktn-provider-postgresql-go_repository-setup_managing-team_B82743C6" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-postgresql-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-postgresql_repository-setup_managing-team_8FC9766E will be created
  + resource "github_team_repository" "cdktn-provider-postgresql_repository-setup_managing-team_8FC9766E" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-postgresql"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (15 unchanged elements hidden)
        "github_repository.cdktn-provider-null_repo_41CFF515.ssh_clone_url",
      + "github_repository.cdktn-provider-postgresql_repo_8DD4A065.ssh_clone_url",
        "github_repository.cdktn-provider-random_repo_D20F5E27.ssh_clone_url",
        # (4 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*